AddressBookScaffolded/app/controllers/addresses_controller.rb

SELECT "addresses".* FROM "addresses"
---
  def index
    @addresses = Address.all

INSERT INTO "addresses" ("name", "office_phone", "email", "created_at", "updated_at", "home_number") VALUES (?, ?, ?, ?, ?, ?)  [["name", "dd"], ["office_phone", "dd"], ["email", "dd"], ["created_at", 2017-03-07 00:43:04 UTC], ["updated_at", 2017-03-07 00:43:04 UTC], ["home_number", "dd"]]
---
  def create
    @address = Address.new(address_params)

    respond_to do |format|
      if @address.save

SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_address
      @address = Address.find(params[:id])