app/controllers/main_controller.rb

SELECT "addresses".* FROM "addresses"
---
  def index
    @addresses = Address.all

INSERT INTO "addresses" ("name", "address", "email", "phone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", ""], ["address", ""], ["email", "ffgj@ddmdm.com"], ["phone", ""], ["created_at", 2017-03-05 03:05:11 UTC], ["updated_at", 2017-03-05 03:05:11 UTC]]
---
  def add
    address = Address.new(address_params)
    if (address.save)

SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "addresses" SET "phone" = ?, "updated_at" = ? WHERE "addresses"."id" = ?  [["phone", "2323"], ["updated_at", 2017-03-05 19:22:56 UTC], ["id", 2]]
---
  def edit
    @address = Address.find(params[:id])
    if request.post?
      if (@address.update_attributes(address_params))

SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "addresses" WHERE "addresses"."id" = ?  [["id", 1]]
---
  def delete
    address = Address.find(params[:id])
    address.destroy